In [2]:
myfood = ['banana', 'apple', 'candy']
print(myfood[0])
print(myfood[1:3])

banana
['apple', 'candy']

In [3]:
for item in myfood:
  print(item)

banana
apple
candy

In [4]:
dict1 = {'one':'하나', 'two':"둘", 'three':'셋'}
dict2 = {1:"하나", 2:"둘", 3:"셋"}
dict3 = {'col1':[1,2,3], 'col2':['a','b','c']}

In [7]:
print(dict1) 
print(dict2)
print(dict3)

{'one': '하나', 'two': '둘', 'three': '셋'}
{1: '하나', 2: '둘', 3: '셋'}
{'col1': [1, 2, 3], 'col2': ['a', 'b', 'c']}

In [8]:
print(dict1['one'])
print(dict2[2])
print(dict3['col2'])

하나
둘
['a', 'b', 'c']

In [11]:
import pandas as pd
import seaborn as sns

from pandas import Series, DataFrame

In [12]:
print('pandas 버전', pd.__version__)

pandas 버전 1.1.3

In [13]:
score = Series( [1000, 14000, 3000, 3000, 1000] )  
print(score) 
print("자료형 확인 : ", type(score))

0     1000
1    14000
2     3000
3     3000
4     1000
dtype: int64
자료형 확인 :  <class 'pandas.core.series.Series'>

In [14]:
## Series 인덱스 확인
print(score.index) 

# 인덱스를 리스트 자료형으로 변경 후, 확인하기
print(list(score.index))   

## Series 값 확인
print(score.values) 

## Series 값 자료형 확인
print(score.dtype)

RangeIndex(start=0, stop=5, step=1)
[0, 1, 2, 3, 4]
[ 1000 14000  3000  3000  1000]
int64

In [15]:
### 인덱스(index) 속성 이용 
score = Series( [1000, 14000, 3000], 
               index = ['2019-05-01', '2019-05-02', '2019-05-03'] )  
print(score)

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
dtype: int64

In [25]:
week = Series(['파이썬', '낮잠', '술', '게임']
             , index = ['2021-06-24', '2021-06-25','2021-06-26','2021-06-27'])
print(week)

2021-06-24    파이썬
2021-06-25     낮잠
2021-06-26      술
2021-06-27     게임
dtype: object

In [26]:
for ad in week.values:
    print(ad)

파이썬
낮잠
술
게임

In [27]:
for asd in week.index:
    print(asd)

2021-06-24
2021-06-25
2021-06-26
2021-06-27

In [30]:
idx = pd.date_range(start="2021-06-21", end="2021-06-25")
idx

DatetimeIndex(['2021-06-21', '2021-06-22', '2021-06-23', '2021-06-24',
               '2021-06-25'],
              dtype='datetime64[ns]', freq='D')

In [31]:
### 인덱스(index) 속성 이용
val = ['음악듣기', '책읽기', '맛난것 먹기', '아무것도 안하기', '좋은 사람 만나기']
schedule = Series( val, index = idx)
schedule

2021-06-21         음악듣기
2021-06-22          책읽기
2021-06-23       맛난것 먹기
2021-06-24     아무것도 안하기
2021-06-25    좋은 사람 만나기
Freq: D, dtype: object

In [32]:
print(schedule['2021-06-21'])

음악듣기

In [33]:
print(schedule.iloc[0:3])

2021-06-21      음악듣기
2021-06-22       책읽기
2021-06-23    맛난것 먹기
Freq: D, dtype: object

In [36]:
print(schedule.loc['2021-06-21':'2021-06-22'])

2021-06-21    음악듣기
2021-06-22     책읽기
Freq: D, dtype: object

In [38]:
schedule.values

array(['음악듣기', '책읽기', '맛난것 먹기', '아무것도 안하기', '좋은 사람 만나기'], dtype=object)

In [39]:
schedule.index

DatetimeIndex(['2021-06-21', '2021-06-22', '2021-06-23', '2021-06-24',
               '2021-06-25'],
              dtype='datetime64[ns]', freq='D')

In [40]:
for ads in schedule.index:
    print(ads)

2021-06-21 00:00:00
2021-06-22 00:00:00
2021-06-23 00:00:00
2021-06-24 00:00:00
2021-06-25 00:00:00

In [41]:
for ads in schedule.values:
    print(ads)

음악듣기
책읽기
맛난것 먹기
아무것도 안하기
좋은 사람 만나기

In [58]:
from pandas import DataFrame
idx = pd.date_range(start="2021-06-21", end="2021-06-23")
idx

DatetimeIndex(['2021-06-21', '2021-06-22', '2021-06-23'], dtype='datetime64[ns]', freq='D')

In [63]:
dat = { 'col1' : [1,2,3,4],
        'col2' : [10,20,30,40],
        'col3' : ['A', 'B', 'C', 'D'] }
df = DataFrame(dat.columns = ['col1', 'col2', 'col3'],index=idx)
df

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (<ipython-input-63-e0dbb8ec9716>, line 4)

In [64]:
from pandas import DataFrame
team_score = { "toto":[1500,3000,5000,7000,5500],
              "apple":[4000,5000,6000,5500,4500],
              "gildong":[2000,2500,3000,4000,3000],
              "catanddog":[7000,5000,3000,5000,4000]}
team_df = DataFrame(team_score)
team_df

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [66]:
idx = pd.date_range(start="2021-06-21", end="2021-06-25")
idx

DatetimeIndex(['2021-06-21', '2021-06-22', '2021-06-23', '2021-06-24',
               '2021-06-25'],
              dtype='datetime64[ns]', freq='D')

In [69]:
date = ['19-05-01','19-05-02', '19-05-03', '19-05-04', '19-05-05']
team_df = DataFrame(team_score,
                   columns=['catanddog', 'toto', 'apple', 'gildong'],
                   index=idx)
team_df

            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000
2021-06-24       5000  7000   5500     4000
2021-06-25       4000  5500   4500     3000

In [78]:
team_df.columns

Index(['catanddog', 'toto', 'apple', 'gildong'], dtype='object')

In [79]:
team_df.index

DatetimeIndex(['2021-06-21', '2021-06-22', '2021-06-23', '2021-06-24',
               '2021-06-25'],
              dtype='datetime64[ns]', freq='D')

In [94]:
team_df.loc['2021-06-21':,'toto':'apple']

            toto  apple
2021-06-21  1500   4000
2021-06-22  3000   5000
2021-06-23  5000   6000
2021-06-24  7000   5500
2021-06-25  5500   4500

In [97]:
team_df.loc['2021-06-21',:]

pandas.core.series.Series

In [98]:
team_df.loc['2021-06-21':'2021-06-23',:]

            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000

In [99]:
team_df.iloc[:, :]

            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000
2021-06-24       5000  7000   5500     4000
2021-06-25       4000  5500   4500     3000

In [101]:
team_df.iloc[:,:1 ]

            catanddog
2021-06-21       7000
2021-06-22       5000
2021-06-23       3000
2021-06-24       5000
2021-06-25       4000

In [108]:
team_df.iloc[1:2,0:]

            catanddog  toto  apple  gildong
2021-06-22       5000  3000   5000     2500

In [113]:
team_df.iloc[0:3,:]

            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000

In [114]:
team_df['toto']

2021-06-21    1500
2021-06-22    3000
2021-06-23    5000
2021-06-24    7000
2021-06-25    5500
Freq: D, Name: toto, dtype: int64

In [121]:
team_df[['toto', 'gildong']]

            toto  gildong
2021-06-21  1500     2000
2021-06-22  3000     2500
2021-06-23  5000     3000
2021-06-24  7000     4000
2021-06-25  5500     3000

In [125]:
team_df.columns

Index(['catanddog', 'toto', 'apple', 'gildong'], dtype='object')

In [138]:
team_df.iloc[:,-1:]

            gildong
2021-06-21     2000
2021-06-22     2500
2021-06-23     3000
2021-06-24     4000
2021-06-25     3000

### iloc. loc
 * [ : ,  : ]
 * loc[행인덱스]
 * iloc[행의 번호 0부터 시작]

## 값 선택
 * 객체명[열이름] : 한개의 열이 선택
 * 객체명[ [열1, 열2 ] ] : 두개 이상의 열이 선택

In [139]:
team_df.describe()

         catanddog         toto        apple      gildong
count     5.000000     5.000000     5.000000     5.000000
mean   4800.000000  4400.000000  5000.000000  2900.000000
std    1483.239697  2162.174831   790.569415   741.619849
min    3000.000000  1500.000000  4000.000000  2000.000000
25%    4000.000000  3000.000000  4500.000000  2500.000000
50%    5000.000000  5000.000000  5000.000000  3000.000000
75%    5000.000000  5500.000000  5500.000000  3000.000000
max    7000.000000  7000.000000  6000.000000  4000.000000

In [140]:
team_df.sum(axis=1)

2021-06-21    14500
2021-06-22    15500
2021-06-23    17000
2021-06-24    21500
2021-06-25    17000
Freq: D, dtype: int64

In [141]:
team_df

            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000
2021-06-24       5000  7000   5500     4000
2021-06-25       4000  5500   4500     3000

In [143]:
team_df['rowsum']
team_df

            catanddog  toto  apple  gildong  rowsum
2021-06-21       7000  1500   4000     2000   14500
2021-06-22       5000  3000   5000     2500   15500
2021-06-23       3000  5000   6000     3000   17000
2021-06-24       5000  7000   5500     4000   21500
2021-06-25       4000  5500   4500     3000   17000

In [145]:
del[team_df['rowsum']]

In [146]:
team_df

            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000
2021-06-24       5000  7000   5500     4000
2021-06-25       4000  5500   4500     3000

In [148]:
team_df['rowsum'] = team_df.sum(axis=1)
team_df

            catanddog  toto  apple  gildong  rowsum
2021-06-21       7000  1500   4000     2000   14500
2021-06-22       5000  3000   5000     2500   15500
2021-06-23       3000  5000   6000     3000   17000
2021-06-24       5000  7000   5500     4000   21500
2021-06-25       4000  5500   4500     3000   17000

In [151]:
team_df['rowsum'].sort_values()

2021-06-21    14500
2021-06-22    15500
2021-06-23    17000
2021-06-25    17000
2021-06-24    21500
Name: rowsum, dtype: int64

In [152]:
team_df['rowsum'].sort_values(ascending = False)

2021-06-24    21500
2021-06-25    17000
2021-06-23    17000
2021-06-22    15500
2021-06-21    14500
Name: rowsum, dtype: int64

In [153]:
team_df['rowsum'].sort_values(ascending = True)

2021-06-21    14500
2021-06-22    15500
2021-06-23    17000
2021-06-25    17000
2021-06-24    21500
Name: rowsum, dtype: int64

### 실습 1-1
 * DataFrame을 하나 만들어 보자, 5행 열2-3개 만들기

In [11]:
import pandas as pd

dat = { "순위":[1,2,3,4],
        "연속":[2,1,1,1],
        "누적":[2,3,2,4],
        "종목명":["솔고바이오", "한세엠케이", "네오오토", "엄지하우스"],
        "현재가":[933,9490, 9990, 4885],
        "전일비":[229, 2190, 2300, 635],
        "등락률":[29.97, 30.00, 29.91, 14.94],
        "거래량":[4657527, 19568672, 3157505, 7231]}

dat_df = pd.DataFrame(dat)
dat_df

   순위  연속  누적    종목명   현재가   전일비    등락률       거래량
0   1   2   2  솔고바이오   933   229  29.97   4657527
1   2   1   3  한세엠케이  9490  2190  30.00  19568672
2   3   1   2   네오오토  9990  2300  29.91   3157505
3   4   1   4  엄지하우스  4885   635  14.94      7231

In [13]:
dat_df = pd.DataFrame(dat,index = date)
dat_df

            순위  연속  누적    종목명   현재가   전일비    등락률       거래량
2021-06-25   1   2   2  솔고바이오   933   229  29.97   4657527
2021-06-26   2   1   3  한세엠케이  9490  2190  30.00  19568672
2021-06-27   3   1   2   네오오토  9990  2300  29.91   3157505
2021-06-28   4   1   4  엄지하우스  4885   635  14.94      7231

In [21]:
dat_df.iloc[1:3]

            순위  연속  누적    종목명   현재가   전일비    등락률       거래량
2021-06-26   2   1   3  한세엠케이  9490  2190  30.00  19568672
2021-06-27   3   1   2   네오오토  9990  2300  29.91   3157505

In [22]:
dat_df.iloc[3]

순위         4
연속         1
누적         4
종목명    엄지하우스
현재가     4885
전일비      635
등락률    14.94
거래량     7231
Name: 2021-06-28, dtype: object

In [24]:
dat_df.loc[['2021-06-26','2021-06-27']]

            순위  연속  누적    종목명   현재가   전일비    등락률       거래량
2021-06-26   2   1   3  한세엠케이  9490  2190  30.00  19568672
2021-06-27   3   1   2   네오오토  9990  2300  29.91   3157505

In [25]:
dat_df.loc['2021-06-28']

순위         4
연속         1
누적         4
종목명    엄지하우스
현재가     4885
전일비      635
등락률    14.94
거래량     7231
Name: 2021-06-28, dtype: object

In [35]:
dat_df.loc['2021-06-26':'2021-06-27','연속':'누적']

            연속  누적
2021-06-26   1   3
2021-06-27   1   2

In [40]:
import pandas as pd

dat = { "순위":[1,2,3,4],
        "연속":[2,1,1,1],
        "누적":[2,3,2,4],
        "종목명":["솔고바이오", "한세엠케이", "네오오토", "엄지하우스"],
        "현재가":[933,9490, 9990, 4885],
        "전일비":[229, 2190, 2300, 635],
        "등락률":[29.97, 30.00, 29.91, 14.94],
        "거래량":[4657527, 19568672, 3157505, 7231]}

dat_df = pd.DataFrame(dat)

date=['2021-06-25', '2021-06-26', '2021-06-27', '2021-06-28']
print(dat_df = pd.DataFrame(dat,index = date))

print(dat_df.iloc[1:3])
print(dat_df.iloc[3])

print(dat_df.loc[['2021-06-26','2021-06-27']])
print((dat_df.loc['2021-06-28'])

SyntaxError: unexpected EOF while parsing (<ipython-input-40-15d0a32297d2>, line 23)